/*某食品工廠製造一塊海綿蛋糕需要5顆蛋.130克砂糖.130克麵粉
一籃蛋100顆,一箱砂糖10包,每包1公斤,一箱麵粉10包,每包0.5公斤
請輸入各原料的存貨量(各原料所剩籃/箱數)和客戶需求量(多少個蛋糕),計算是否需要進貨,以及進貨的數量*/ 

#include<stdio.h>

int main(){
		
		int n1,n2,n3,a,b,c,req;
		
		printf("請輸入剩餘幾籃雞蛋?幾箱砂糖?幾箱麵粉?");
		scanf("%d %d %d",&n1,&n2,&n3);
		
		printf("請輸入客戶需要多少海綿蛋糕?");
		scanf("%d",&req);
		
		a = n1*100 - 5*req;   // 雞蛋最後的數量 (顆) 
		b = n2*10*1 - 0.13*req;  //砂糖最後的數量 (公斤) 
		c = n3*10*0.5 - 0.13*req;  //麵粉最後的數量 (公斤) 
	
		
		a1 = a/100; // 雞蛋最後的數量(籃) 
		b1 = b/10;  // 砂糖最後的數量(箱) 
		c1 = c/5;  // 麵粉最後的數量(箱) 
		 
		
		if(  )
		{
			printf("仍缺少%d個海綿蛋糕",);
		}
		else
		{
			printf("無須進貨"); 
		}
		printf("需進貨%d籃雞蛋 %d箱砂糖 %d箱麵粉",);
}
