/*設計一程式，計算計程車車資，一共有兩種計算方式
(1)日間計費:基本費70元，每200公尺跳表一次，一次5元
超過一公里的部分，變成每100公尺跳表一次，一次5元。
(2)夜間計費:和日間計費標準相同，基本費多收30元。 */ 
 
 #include<stdio.h>
 
 int main(){
 	    
 	    int a,b,c,n1,n2,sum;
 	    printf("請輸入要日間計費(1)或夜間計費(2):\n");
 	    scanf("%d",&a);
 	    
 	    if (a==1)
 	    {
 	    	c=70;
		 }
		else
		{
			c=100;
		 }
		 
 	    printf("輸入里程數:\n");
 	    scanf("%d",&n1);
		n2=n1/100; 
		
	    if(n2<=10)
	    {
	    	sum=c+5*(n1/200);
		}
        else
		{
			sum=(c+25)+5*(n2-10);
		}	    
 	    printf("總共是%d元",sum); 
        return 0;	
 	
 	
 } 
